Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G68.tmx
Source language: en_us
Languages: zh_cn

source: I Had a Stroke at 33
zh_cn: 33岁那年，我中风了

source: On New Year's Eve 2007, a clot blocked one half of my brain from the other.
zh_cn: 2007年新年前夜，我半脑梗塞，生活从此翻天覆地。

source: There was a cascade of input - triangles and sky and gravel sound and music on the radio and wind and the feeling of rough cloth near my hands.
zh_cn: 脑子里涌进来一堆东西——三角形、天空、砾石的声音、广播里传出的音乐、风声，以及手边摸起来粗糙的布料感觉。

source: I could not make sense of it all; I did not know the small triangles were trees, the larger ones mountains, the sound tires crunching snow and Snow Patrol, the jacket Gore-Tex, and that my wrists were the things attached to things called my hands.
zh_cn: 我完全搞不清是什么，不知道小三角实际上是树、大三角是山、声音来自轮胎碾压积雪和雪地巡警队，布料其实是戈尔特斯外套，甚至连手腕连接的手这个器官都感觉不到。

source: They were colors and shapes and sound and touch and sensation and my brain was no longer sorting these things out.
zh_cn: 我的大脑再也无法分辨颜色、外形、声音、触觉和感觉。

source: But when I saw the red snowblowers in the parking lot turned 90 degrees and doubled, I finally had a complete thought. I comprehended what I was seeing.
zh_cn: 可当我看到停车场有一辆红色的吹雪机呈90度翻倒，还是重影的，就完全明白了是怎么回事。

source: Red snowblowers. Sideways.
zh_cn: 原来是红色的吹雪机、侧翻。

source: Strange.
zh_cn: 怪了。

source: That was what my stroke felt like: like I was separating from myself.
zh_cn: 这就是我中风以后的感受：好像自己从身体里游离出来了。

source: It was Dec. 31, 2006. I was 33.
zh_cn: 那是2006年12月31日，我33岁，还不知道中风这回事。

source: I did not yet know this, but a clot had traveled from my aorta into my brain, and made its way to my left thalamus.
zh_cn: 但血块经由主动脉进入大脑，直达左丘脑。

source: As a result, my left brain, the expert at numbers and language and logic and reasoning, a part of it suffocated and died. My right brain, the specialist with regard to color, music, creativity, intuition, and emotions, therefore could not talk to my left brain.
zh_cn: 结果，负责处理数字、语言以及逻辑推理的部分左脑细胞窒息而死，致使负责颜色、音乐、创意、直觉和感情的右脑无法与之沟通。

source: Numbers became squiggles, colors lost their names, food lost flavor, music had no melody.
zh_cn: 于是数字成了不规则曲线，颜色叫不上名字，食品没了味道，音乐失去了旋律。

source: This is not normal; this is beautiful, I thought. But I am dizzy like I am on a boat. And my head hurts.
zh_cn: 我觉得这和平常不一样，还挺美，可是我头昏眼花，像在船上，头也疼起来了。

source: "I need to sit down," I managed to say. I had not yet lost my words. I was in the middle of a parking lot.
zh_cn: “我得坐一下，”我尽力说出这话，那时还没失去语言能力，人就在停车场中央。

source: "I'll go inside, and you sit here," my then-husband said, telling me to sit on the curb outside the store. That he would be right back.
zh_cn: “我进去看看，你坐这儿。”我那时的丈夫说，他叫我坐在商店外面的路边，他很快回来

source: He disappeared and came out empty-handed because even he knew there was a problem.
zh_cn: 他走开了，回来的时候两手空空，因为连他都觉得出了问题。

source: "Let's head back," he said. "There's no way I can buy filters while you're out here.
zh_cn: “咱们回去吧，”他说，“你这样在外面，我没法买过滤器。

source: Something's wrong."
zh_cn: 不对劲。”

source: And eventually, my thoughts subsided. My brain went dark. Dark.
zh_cn: 最后，我意识模糊，大脑昏沉。

source: I cannot remember that ride back to the house as much as I try, years later.
zh_cn: 多年后不管我如何努力回想，都记不起当时怎么乘车回家。

source: I was tired, so I napped. (Sleeping is not recommended immediately after or during a stroke.)
zh_cn: 当时感觉很累，就打了个盹。（其实若是处在中风状态或是刚刚恢复过来，立马睡觉是不可取的。）

source: I dreamed about getting lost in the snowy mountains. I dreamed about walking a frozen Alpine lake. I dreamed about losing my shoes. I dreamed about losing my voice.
zh_cn: 我梦到自己在雪山上迷路了，梦到行走在冰封的阿尔卑斯山湖面，梦到把鞋给丢了、话也说不出来。

source: When I woke up hours later, I really believed I had been in those mountains hiking - that it was not a dream.
zh_cn: 几小时后我醒来，相信自己真的爬过那些高山，不是梦。

source: And I really had lost my voice. I had lost my words. I was unable to say, "I am trapped in my brain" or, "My memories are mixing with imagination."
zh_cn: 我也真的失声了，说不出话来，丧失了语言能力，“我大脑思维混乱”，或者说“记忆中混杂着想象。”

source: Our friends had arrived to celebrate New Year's and all I could do was smile and say, "Hello."
zh_cn: 朋友们都来庆祝新年。我什么也做不了，只能微微一笑，说：“你好。”

source: Just, "hello."
zh_cn: 我只会说“你好”。

source: They were excited to join us, and in the hubbub, I was silent.
zh_cn: 他们都很高兴，聊得好不热闹，而我却一句话也没说。

source: I am never silent. I also never nap.
zh_cn: 我原来不是这样的，不会沉默，从不打盹。

source: "Hi, I'm having a brain drain," I said. I watched myself struggle. Underneath what felt like 100 down blankets, what was left of the pre-stroke self said, "That is not what I meant to say. Something is wrong."
zh_cn: “嘿，我脑子二虎了，”我说，看着自己在挣扎，身下像盖了100床羽绒被，中风前的那个我说：“这不是我想说的，肯定哪出问题了。”

source: But no one, not even I, could hear or understand.
zh_cn: 但是没一个人听到或理解这些话，甚至我自己都不能。

source: I tried to join my friends' conversation, but the words were too fast, the subject matter switching all the time.
zh_cn: 我努力想加入他们的交谈中，但是他们说的太快了，话题总是在变。

source: I opened my mouth to add something, but I couldn't form the words.
zh_cn: 我张口想补充点什么，又组织不了语言。

source: We went out for fondue.
zh_cn: 我们出去吃奶酪火锅。

source: I don't remember if I ate the fondue.
zh_cn: 现在我也不记得自己吃了没有。

source: This was what I blogged that evening in an attempt to communicate what I was experiencing:
zh_cn: 那晚我写了一篇博客，记录尝试交流的经历。那篇博客是这样写的：

source: I am feeling strange. My brain is in a weird state right now - a combination of short brain games and lack of memory.
zh_cn: 我感觉很奇怪，大脑状态怪异，脑子不够用，记忆力下降。

source: While taking on the concept of a brain game earlier today, I suffered a memory overhaul.
zh_cn: 今早我玩了以前常玩的智力游戏，记忆力大幅下降。

source: Now I can't say what I want to say or remember what I want to remember.
zh_cn: 现在我想说什么，说不了，想记什么，也记不住。

source: It's just a weird situation.
zh_cn: 这种状况太荒诞了。

source: Just 17 hours earlier, pre-stroke, I'd written the following in my journal:
zh_cn: 中风前17个钟头，我还在日记里写道：

source: So this is how it feels to hole up somewhere: the snow has come on and off this week, the chilly air outside has the snap of a crisp spring peapod, and all is peaceful.
zh_cn: 这就是远离外界的感觉：这周雪花来了，又走了，外面寒风习习，吹打着又脆又嫩的豆荚。一切都是那么祥和。

source: There is no external stimulation; my life has turned inward this week.
zh_cn: 没有外界干扰，这周我的生活转而向内。

source: Reading books.
zh_cn: 读书养心。

source: When I checked my blog much later, there were comments from 12 of my friends urging me to go to the hospital.
zh_cn: 后来看博客时，有12个朋友留言催我快去看医生。

source: "Something is very wrong," they said. "We are worried."
zh_cn: 他们说，“情况非常糟糕，我们很担心。”

source: People have asked if anyone around me could tell I was having a stroke.
zh_cn: 有人问，周围的人是否看出我正在中风。

source: "Weren't you acting weird?" they'd ask, and my husband's mouth would turn into a thin line, and my friends who joined us for New Year's would lower their eyes.
zh_cn: “你行为没什么异常吗？”他们问，这时我老公便抿着嘴，参加我们新年聚会的朋友们也会垂下眼睛。

source: I was acting weird, yes. But it was New Year's Eve.
zh_cn: 是，我确实行为怪异，但那是新年前夜。

source: My friends and husband were drunk and jolly. I was not talking. They thought that was odd, but not cause for huge concern. They thought that perhaps I too was drunk.
zh_cn: 我老公和朋友们都喝的很开心，我一句话没说，他们觉得奇怪，但也没有过多关注，可能觉得我也喝多了。

source: Besides, I did not have the classic symptoms of a stroke.
zh_cn: 此外，我没有典型的中风症状。

source: The Stroke Association uses the mnemonic device FAST:
zh_cn: 中风协会用以快速识别中风法的FAST字诀如下：

source: Face: Ask the person to smile.
zh_cn: 脸：让患者微笑。

source: Does one side of the face droop?
zh_cn: 一侧脸部下垂吗？

source: Mine did not.
zh_cn: 我没有这个症状。

source: Arms: Ask the person to raise both arms.
zh_cn: 胳膊：让患者举起双臂。

source: Does one arm drift downward?
zh_cn: 一侧胳膊会无力下垂吗？

source: Speech: Ask the person to repeat a simple phrase.
zh_cn: 言语：让患者重复一句简短的话。

source: Is their speech slurred or strange?
zh_cn: 他们是否吐字不清或言语奇怪？

source: My speech was not slurred.
zh_cn: 我没有吐字不清。

source: Time: If you observe any of these signs, call 911 immediately.
zh_cn: 时间：如果发现上述三条中的任何一条症状，立即拨打911。

source: I did not.
zh_cn: 我没有。

source: Two days after the stroke, we returned home to Berkeley
zh_cn: 中风两天后，我们回到了伯克利的家里。

source: "I still don't feel well," I told my husband. "I'm staying home from work."
zh_cn: “我还是觉得不舒服，”我跟老公说，“我不去上班了。”

source: "OK."
zh_cn: “好的。”

source: Our fridge was empty.
zh_cn: 我们的冰箱空了。

source: I went to Andronico's grocery store and browsed the aisles, a blur of colors and letters and shapes.
zh_cn: 我去了安德罗尼科杂货铺，站在过道上看着这些商品，眼前全是模糊的颜色、字母和图形。

source: What was it we needed? I wondered.
zh_cn: 我在疑惑，我们需要些什么？

source: I could not figure out how the pieces fit together, that I would need onions because we used onions for everything, that I would need bread for sandwiches, that I would need meat for a possible entree.
zh_cn: 我没办法把这些碎片拼凑起来的。我需要洋葱，因为做什么都少不了洋葱；我需要面包来做三明治，肉来做主餐。

source: They were shapes and colors and textures.
zh_cn: 但这些在我看来都是些图形、颜色和纹理。

source: That fleshy pink package was a fleshy pink rectangle.
zh_cn: 那个新鲜的粉色包装是个新鲜的粉色矩形。

source: The countless numbers of canned soup and canned vegetables were mere metal cylinders.
zh_cn: 那数不尽的汤品罐头和蔬菜罐头都只不过是金属罐。

source: I emerged with one thing: a jar of Muir Glen spaghetti sauce.
zh_cn: 我忽然看到一样东西：一罐缪尔格伦牌意大利面酱。

source: I grabbed it because I had seen it before, because I could read the label.
zh_cn: 我一把把它抓起，因为我之前见过，也能读懂标签。

source: If it was something I could understand, it must be something I needed.
zh_cn: 如果这是我能懂的东西，那就一定是我需要的东西。

source: I did not need spaghetti sauce.
zh_cn: 但事实上我不需要意大利面酱。

source: I still do not remember how it is I paid, whether by cash or by debit or credit card.
zh_cn: 我依旧记不清我到底是怎样付的款，现金？借记卡？还是信用卡？

source: I do not remember swiping or handing over bills.
zh_cn: 我也不记得刷卡和接过账单。

source: I just remember blinking in the cold winter sun at my car in the parking lot. Holding a jar of spaghetti sauce.
zh_cn: 我只记得在那个寒冷的冬日阳光里，我站在停车场自己的车边茫然地眨巴着眼睛，手里拿着一罐意大利面酱。

source: And wondering how to get home. I did not know how to get home.
zh_cn: 我思考着要怎样回家，不知道该怎么走。

source: I got in the car and started driving.
zh_cn: 我进车发动起来。

source: If I just drove, I thought, I would somehow get home.
zh_cn: 我想，只要把车开起来，总能到家的。

source: Each time I thought about whether I needed to make a left turn or right or stop or go, I felt lost. I had no idea.
zh_cn: 每次当我考虑是否需要左拐或右拐、停下来还是继续走的时候，就会感到茫然，没有一点头绪。

source: And so I pressed on without thinking, while relying on intuition.
zh_cn: 因此我逼着自己不去想，靠直觉走。

source: Each time I stopped, I recognized landmarks - a tree or a house or a store.
zh_cn: 每次停下，我都能认出一些路标——一棵树、一栋房子或者一家商店。

source: I knew I was getting closer to home, but I did not know how to continue.
zh_cn: 我知道离家越来越近了，但是我仍然不知道要怎么继续。

source: Intuition carried me when logic and memory failed.
zh_cn: 当逻辑和记忆都不管用的时候，我全凭感觉。

source: I made it home.
zh_cn: 我成功到家了。

source: And then I thought, I need to get to a hospital.
zh_cn: 之后我想，我该去看医生了。

source: I picked up the phone and then I asked myself, What is the phone number for 911?
zh_cn: 我拿起电话然后自问，急救电话的号码是多少？

source: I looked at the numeric keypad, and I could not figure out what number each shape represented. And what is the number for 911?
zh_cn: 我看着电话键盘，没办法弄清楚每个键代表的是哪个数字，哪几个数字是911？

source: I thought perhaps I should try calling my husband. I could not remember his phone number, either. It did not occur to me to look for it in the contacts list on my BlackBerry, either.
zh_cn: 我想或许应该试着打给我丈夫，可我也记不起他的电话号码，想不起应该去查黑莓手机里的通讯录。

source: I finally decided I would mash a bunch of numbers on the keypad and talk to whomever it was I dialed on the landline.
zh_cn: 我最终决定在键盘上随便拨几个数字，与接通的人——不管是谁谈谈。

source: I did not think about the fact that I did not know where I lived, but I punched in a set of numbers anyway.
zh_cn: 我没考虑到我都不知道我住哪，但是我还是拨出了一串数字。

source: "Hello," a man said.
zh_cn: “你好，”一个男人的声音。

source: "Hi!" I said.
zh_cn: “你好！”我说。

source: "Hi," he said.
zh_cn: “你好，”他回答。

source: "Who is this?" I asked.
zh_cn: “您是哪位？”我问他。

source: "This is A-," he replied.
zh_cn: “我是......，”他回答说。

source: "Oh! I have been trying to reach you!
zh_cn: “噢！我一直尝试联系你！

source: I forgot your phone number and I didn't know how to get ahold of you!
zh_cn: 我忘记了你的电话号码，不知道要怎么联系到你！

source: I called this phone number, because it was in my fingers."
zh_cn: 我随手按了这个号码，于是我就拨通了它。”

source: "I'm coming right home," he said.
zh_cn: “我这就回家，”他说。

source: We went to the emergency room where they gave me a CT scan to get an idea of what was going on in my head.
zh_cn: 我们去了急救室，医生给我做了CT，看看我的大脑到底怎么了。

source: There's a dark spot on the CT. "We think you have vasculitis," said the doctor.
zh_cn: CT上有黑点， 医生说:“ 我们认为你患有脉管炎。”

source: In my files, I later read the hospitalist's dictation: "Patient has focal low attenuating area in anterior left thalamus."
zh_cn: 过后，我在病例中看了医师的记录： “病人前左丘脑呈现重度低衰减区。”

source: In other words, there was a scar in my brain.
zh_cn: 换句话说，我的大脑里有条疤痕。

source: At the time I said, "OK."
zh_cn: 那时我说，“没问题。”

source: He continued, "We think it's vasculitis and we need to admit you for more tests."
zh_cn: 医生继续说着，“我们认为这是脉管炎，但还是得让你做更多检查才能确定。”

source: My husband joked, "We need Dr. House."
zh_cn: 我丈夫开玩笑说，“我们得找豪斯医生。”

source: I loved the MRI the next morning.
zh_cn: 我喜欢第二天早上的磁共振。

source: It was peaceful inside the tube with the thumping noises.
zh_cn: 扫描仓里声响巨大却让人感觉平静。

source: I closed my eyes and imagined a beach, ocean waves crashing, a distant horizon.
zh_cn: 我闭上了双眼，想象沙滩、海浪拍打、遥远的地平线。

source: I wondered what kind of imagery that would produce on the MRI - if they would see that I was thinking of water.
zh_cn: 我不知道核磁共振将产生什么样的图像， 他们是否看到我在想象水。

source: I wondered if my brain would light up like a beach at sunset.
zh_cn: 我想知道，我的大脑是否会像海滩一样被落日点亮。

source: And then a neurologist came to me with the results. "Hi, Christine, we have discovered you've had a stroke."
zh_cn: 接着一位脑神经专家拿着测试结果对我说：“你好，克日斯汀，我们发现你患有中风。”

source: What did they think I had?
zh_cn: 他们原先以为我得了什么病？

source: "Vasculitis."
zh_cn: “脉管炎。”

source: And what did I have?
zh_cn: “那我实际上是什么病？”

source: "A left thalamic stroke."
zh_cn: “左丘脑中风。”

source: OK.
zh_cn: 好吧。

source: But - what did they think I had?
zh_cn: 但是，他们原先以为我得了什么病？

source: The thalamus is the hub of the brain, its traffic circle.
zh_cn: 丘脑是大脑的枢纽中心。

source: Each side of the thalamus is the size and shape of a walnut, or the same size, weight, and shape of a marine iguana's brain.
zh_cn: 丘脑位于大脑两侧，有与核桃的大小、形状显示，或者说和海鬣蜥的大脑有着相同的尺寸、重量和形状。

source: It regulates sleep. It relays messages.
zh_cn: 它负责调节睡眠，转发消息。

source: Too much damage to the thalamus results in permanent coma.
zh_cn: 丘脑受到太大伤害的话，会导致永久性昏迷。

source: I slept. And slept. And slept. I slept dreamless then, and dreamless for months.
zh_cn: 我睡了又睡，睡了又谁，都是无梦而眠，后来几个月都没有梦。

source: Or maybe I dreamt, but do not remember.
zh_cn: 或许我做梦了，只是不记得了。

source: Awake I had a 15-minute short-term memory, like Dory the fish in Finding Nemo.
zh_cn: 醒着的我有15分钟短期记忆，就像《海底总动员》中的多莉鱼。

source: My doctors instructed me to log happenings with timestamps in my Moleskine journal.
zh_cn: 医生指导我在“鼹鼠皮”牌日记本上依照时间顺序记下发生的事。

source: That, they said, would be my working short-term memory. My memento to my mori.
zh_cn: 他们说，那会是我随时写下的短期记忆，垂死的纪念。

source: I was the youngest person in the stroke unit by 40 years.
zh_cn: 我是中风科40年来最年轻的患者。

source: The staff called me Forty-Seven - the last two digits of my room number.
zh_cn: 医务人员称我“47号”——病房号码的最后两位数字。

source: I only know this detail now because I re-read my journal, in which I recorded my entire experience, aphasia and all.
zh_cn: 我知道这个细节，是因为重新看了日记，我在其中记录了整个经历、失语和所有细节。

source: I wandered the halls of the hospital, wheeling my heart monitor and heparin on an IV pole.
zh_cn: 我徘徊在医院大厅里，转动着心脏监测器和输液架上的肝素输液袋。

source: I lost track of time. I wandered outside the boundaries of telemetry.
zh_cn: 我忘记了时间，漫步走出遥测装置监控区。

source: They lost my heartbeat.
zh_cn: 他们收不到我的心跳。

source: When I returned, they scolded me.
zh_cn: 当我返回时，他们责怪了我。

source: "I won't do it again," I said, but then I forgot and wandered again.
zh_cn: “我再也不外出了，” 我回敬道，但过后我全忘了，又开始四处游荡。

source: At one point during my hospital stay, my friends visited.
zh_cn: 住院期间朋友们来看我。

source: They greeted me by saying, "You look completely normal!"
zh_cn: 他们问候说：“你看上去完全正常了！”

source: The neuropsychiatrist stepped in.
zh_cn: 神经病学家进入病房。

source: "Hello."
zh_cn: “你好。”

source: "Hi."
zh_cn: “好。”

source: "Do you know who I am?"
zh_cn: “认识我吗？”

source: "No, but it's nice to meet you."
zh_cn: “不认识，很高兴认识你。”

source: "Open up your journal."
zh_cn: “打开你的日记吧。”

source: I did.
zh_cn: 我照做。

source: "What time is it now?
zh_cn: “现在几点了？

source: What is the timestamp in the last entry?"
zh_cn: 最近一次记录是什么时候？”

source: "It's 10:35. Oh! I met you 20 minutes ago!
zh_cn: “10:35，哦！20分钟前我见过你！
